SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_agc.h
  __IOM uint32_t PNRFATT2_CLR;                  /**< PN RF attenuation code group 2                     */
  __IOM uint32_t PNRFATT3_CLR;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT4_CLR;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT5_CLR;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT6_CLR;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT7_CLR;                  /**< PN RF attenuation code group 3                     */
  uint32_t       RESERVED13[4U];                /**< Reserved for future use                            */
  __IOM uint32_t PNRFATTALT_CLR;                /**< PN RF attenuation code group 3                     */
  __IOM uint32_t LNAMIXCODE0_CLR;               /**< LNA/MIX slice code group 0                         */
  __IOM uint32_t LNAMIXCODE1_CLR;               /**< LNA/MIX slice code group 1                         */
  __IOM uint32_t PGACODE0_CLR;                  /**< PGA gain code group 0                              */
  __IOM uint32_t PGACODE1_CLR;                  /**< PGA gain code group 1                              */
  __IOM uint32_t LBT_CLR;                       /**< Configure AGC for (ETSI) LBT                       */
  __IOM uint32_t MIRRORIF_CLR;                  /**< Mirror Interrupt Flags Register                    */
  __IOM uint32_t SEQIF_CLR;                     /**< SEQ Interrupt Flags Register                       */
  __IOM uint32_t SEQIEN_CLR;                    /**< SEQ Interrupt Enable Register                      */
  __IOM uint32_t RSSIABSTHR_CLR;                /**< RSSI absolute threshold                            */
  __IOM uint32_t LNABOOST_CLR;                  /**< LNA boost control register                         */
  __IOM uint32_t ANTDIV_CLR;                    /**< Antenna diversity AGC setting                      */
  __IOM uint32_t DUALRFPKDTHD0_CLR;             /**< Thresholds for dual rfpkd                          */
  __IOM uint32_t DUALRFPKDTHD1_CLR;             /**< Thresholds for dual rfpkd                          */
  __IOM uint32_t SPARE_CLR;                     /**< Spare register for ECO                             */
  __IOM uint32_t PNRFFILT0_CLR;                 /**< PN RF attenuation code group 0                     */
  __IOM uint32_t PNRFFILT1_CLR;                 /**< PN RF attenuation code group 1                     */
  __IOM uint32_t PNRFFILT2_CLR;                 /**< PN RF attenuation code group 2                     */
  __IOM uint32_t PNRFFILT3_CLR;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT4_CLR;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT5_CLR;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT6_CLR;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT7_CLR;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t FENOTCHATT0_CLR;               /**< FE Notch attenuation code group 0                  */
  __IOM uint32_t FENOTCHATT1_CLR;               /**< FE Notch attenuation code group 1                  */
  __IOM uint32_t FENOTCHATT2_CLR;               /**< FE Notch attenuation code group 2                  */
  __IOM uint32_t FENOTCHATT3_CLR;               /**< FE Notch attenuation code group 3                  */
  __IOM uint32_t FENOTCHATT4_CLR;               /**< FE Notch attenuation code group 4                  */
  __IOM uint32_t FENOTCHATT5_CLR;               /**< FE Notch attenuation code group 5                  */
  __IOM uint32_t FENOTCHATT6_CLR;               /**< FE Notch attenuation code group 6                  */
  __IOM uint32_t FENOTCHATT7_CLR;               /**< FE Notch attenuation code group 7                  */
  __IOM uint32_t FENOTCHATT8_CLR;               /**< FE Notch attenuation code group 8                  */
  __IOM uint32_t FENOTCHATT9_CLR;               /**< FE Notch attenuation code group 9                  */
  __IOM uint32_t FENOTCHATT10_CLR;              /**< FE Notch attenuation code group 10                 */
  __IOM uint32_t FENOTCHATT11_CLR;              /**< FE Notch attenuation code group 11                 */
  __IOM uint32_t FENOTCHFILT0_CLR;              /**< FE Notch filter code group 0                       */
  __IOM uint32_t FENOTCHFILT1_CLR;              /**< FE Notch filter code group 1                       */
  __IOM uint32_t FENOTCHFILT2_CLR;              /**< FE Notch filter code group 2                       */
  __IOM uint32_t FENOTCHFILT3_CLR;              /**< FE Notch filter code group 3                       */
  __IOM uint32_t FENOTCHFILT4_CLR;              /**< FE Notch filter code group 4                       */
  __IOM uint32_t FENOTCHFILT5_CLR;              /**< FE Notch filter code group 5                       */
  __IOM uint32_t FENOTCHFILT6_CLR;              /**< FE Notch filter code group 6                       */
  __IOM uint32_t FENOTCHFILT7_CLR;              /**< FE Notch filter code group 7                       */
  __IOM uint32_t FENOTCHFILT8_CLR;              /**< FE Notch filter code group 8                       */
  __IOM uint32_t FENOTCHFILT9_CLR;              /**< FE Notch filter code group 9                       */
  __IOM uint32_t FENOTCHFILT10_CLR;             /**< FE Notch filter code group 10                      */
  __IOM uint32_t FENOTCHFILT11_CLR;             /**< FE Notch filter code group 11                      */
  __IM uint32_t  CCADEBUG_CLR;                  /**< CCA debug register                                 */
  uint32_t       RESERVED14[935U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version                                         */
  __IOM uint32_t EN_TGL;                        /**< Enable peripheral clock to this module             */
  __IM uint32_t  STATUS0_TGL;                   /**< Status register 0                                  */
  __IM uint32_t  STATUS1_TGL;                   /**< Status register 1                                  */
  __IM uint32_t  STATUS2_TGL;                   /**< Status register 2                                  */
  uint32_t       RESERVED15[1U];                /**< Reserved for future use                            */
  __IM uint32_t  RSSI_TGL;                      /**< Received Signal Strength Indicator                 */
  __IM uint32_t  FRAMERSSI_TGL;                 /**< FRAME RSSI value                                   */
  __IOM uint32_t CTRL0_TGL;                     /**< Control register 0                                 */
  __IOM uint32_t CTRL1_TGL;                     /**< Control register 1                                 */
  __IOM uint32_t CTRL2_TGL;                     /**< Control register 2                                 */
  __IOM uint32_t CTRL3_TGL;                     /**< Control register 3                                 */
  __IOM uint32_t CTRL4_TGL;                     /**< Control register 4                                 */
  __IOM uint32_t CTRL5_TGL;                     /**< Control register 5                                 */
  __IOM uint32_t CTRL6_TGL;                     /**< Control register 6                                 */
  __IOM uint32_t CTRL7_TGL;                     /**< Control register 1                                 */
  __IOM uint32_t RSSISTEPTHR_TGL;               /**< RSSI step threshold                                */
  uint32_t       RESERVED16[1U];                /**< Reserved for future use                            */
  __IOM uint32_t IF_TGL;                        /**< Interrupt Flags Register                           */
  __IOM uint32_t IEN_TGL;                       /**< Interrupt Enable Register                          */
  uint32_t       RESERVED17[1U];                /**< Reserved for future use                            */
  __IOM uint32_t GAINRANGE_TGL;                 /**< Range of RX Gain to use in AGC                     */
  __IOM uint32_t AGCPERIOD0_TGL;                /**< AGC period                                         */
  __IOM uint32_t AGCPERIOD1_TGL;                /**< AGC Period                                         */
  __IOM uint32_t HICNTREGION0_TGL;              /**< Hi-counter region-0                                */
  __IOM uint32_t HICNTREGION1_TGL;              /**< Hi-counter region-1                                */
  __IOM uint32_t STEPDWN_TGL;                   /**< Hi-counter region-2                                */
  __IOM uint32_t GAINSTEPLIM0_TGL;              /**< Limits for Gain Steps                              */
  __IOM uint32_t GAINSTEPLIM1_TGL;              /**< Limits for Gain Steps                              */
  __IOM uint32_t PNRFATT0_TGL;                  /**< PN RF attenuation code group 0                     */
  __IOM uint32_t PNRFATT1_TGL;                  /**< PN RF attenuation code group 1                     */
  __IOM uint32_t PNRFATT2_TGL;                  /**< PN RF attenuation code group 2                     */
  __IOM uint32_t PNRFATT3_TGL;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT4_TGL;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT5_TGL;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT6_TGL;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT7_TGL;                  /**< PN RF attenuation code group 3                     */
  uint32_t       RESERVED18[4U];                /**< Reserved for future use                            */
  __IOM uint32_t PNRFATTALT_TGL;                /**< PN RF attenuation code group 3                     */
  __IOM uint32_t LNAMIXCODE0_TGL;               /**< LNA/MIX slice code group 0                         */
  __IOM uint32_t LNAMIXCODE1_TGL;               /**< LNA/MIX slice code group 1                         */
  __IOM uint32_t PGACODE0_TGL;                  /**< PGA gain code group 0                              */
  __IOM uint32_t PGACODE1_TGL;                  /**< PGA gain code group 1                              */
  __IOM uint32_t LBT_TGL;                       /**< Configure AGC for (ETSI) LBT                       */
  __IOM uint32_t MIRRORIF_TGL;                  /**< Mirror Interrupt Flags Register                    */
  __IOM uint32_t SEQIF_TGL;                     /**< SEQ Interrupt Flags Register                       */
  __IOM uint32_t SEQIEN_TGL;                    /**< SEQ Interrupt Enable Register                      */
  __IOM uint32_t RSSIABSTHR_TGL;                /**< RSSI absolute threshold                            */
  __IOM uint32_t LNABOOST_TGL;                  /**< LNA boost control register                         */
  __IOM uint32_t ANTDIV_TGL;                    /**< Antenna diversity AGC setting                      */
  __IOM uint32_t DUALRFPKDTHD0_TGL;             /**< Thresholds for dual rfpkd                          */
  __IOM uint32_t DUALRFPKDTHD1_TGL;             /**< Thresholds for dual rfpkd                          */
  __IOM uint32_t SPARE_TGL;                     /**< Spare register for ECO                             */
  __IOM uint32_t PNRFFILT0_TGL;                 /**< PN RF attenuation code group 0                     */
  __IOM uint32_t PNRFFILT1_TGL;                 /**< PN RF attenuation code group 1                     */
  __IOM uint32_t PNRFFILT2_TGL;                 /**< PN RF attenuation code group 2                     */
  __IOM uint32_t PNRFFILT3_TGL;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT4_TGL;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT5_TGL;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT6_TGL;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT7_TGL;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t FENOTCHATT0_TGL;               /**< FE Notch attenuation code group 0                  */
  __IOM uint32_t FENOTCHATT1_TGL;               /**< FE Notch attenuation code group 1                  */
  __IOM uint32_t FENOTCHATT2_TGL;               /**< FE Notch attenuation code group 2                  */
  __IOM uint32_t FENOTCHATT3_TGL;               /**< FE Notch attenuation code group 3                  */
  __IOM uint32_t FENOTCHATT4_TGL;               /**< FE Notch attenuation code group 4                  */
  __IOM uint32_t FENOTCHATT5_TGL;               /**< FE Notch attenuation code group 5                  */
  __IOM uint32_t FENOTCHATT6_TGL;               /**< FE Notch attenuation code group 6                  */
  __IOM uint32_t FENOTCHATT7_TGL;               /**< FE Notch attenuation code group 7                  */
  __IOM uint32_t FENOTCHATT8_TGL;               /**< FE Notch attenuation code group 8                  */
  __IOM uint32_t FENOTCHATT9_TGL;               /**< FE Notch attenuation code group 9                  */
  __IOM uint32_t FENOTCHATT10_TGL;              /**< FE Notch attenuation code group 10                 */
  __IOM uint32_t FENOTCHATT11_TGL;              /**< FE Notch attenuation code group 11                 */
  __IOM uint32_t FENOTCHFILT0_TGL;              /**< FE Notch filter code group 0                       */
  __IOM uint32_t FENOTCHFILT1_TGL;              /**< FE Notch filter code group 1                       */
  __IOM uint32_t FENOTCHFILT2_TGL;              /**< FE Notch filter code group 2                       */
  __IOM uint32_t FENOTCHFILT3_TGL;              /**< FE Notch filter code group 3                       */
  __IOM uint32_t FENOTCHFILT4_TGL;              /**< FE Notch filter code group 4                       */
  __IOM uint32_t FENOTCHFILT5_TGL;              /**< FE Notch filter code group 5                       */
  __IOM uint32_t FENOTCHFILT6_TGL;              /**< FE Notch filter code group 6                       */
  __IOM uint32_t FENOTCHFILT7_TGL;              /**< FE Notch filter code group 7                       */
  __IOM uint32_t FENOTCHFILT8_TGL;              /**< FE Notch filter code group 8                       */
  __IOM uint32_t FENOTCHFILT9_TGL;              /**< FE Notch filter code group 9                       */
  __IOM uint32_t FENOTCHFILT10_TGL;             /**< FE Notch filter code group 10                      */
  __IOM uint32_t FENOTCHFILT11_TGL;             /**< FE Notch filter code group 11                      */
  __IM uint32_t  CCADEBUG_TGL;                  /**< CCA debug register                                 */
} AGC_TypeDef;
/** @} End of group MGM24_AGC */

/**************************************************************************//**
 * @addtogroup MGM24_AGC
 * @{
 * @defgroup MGM24_AGC_BitFields AGC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for AGC IPVERSION */
#define _AGC_IPVERSION_RESETVALUE                      0x00000003UL                            /**< Default value for AGC_IPVERSION             */
#define _AGC_IPVERSION_MASK                            0xFFFFFFFFUL                            /**< Mask for AGC_IPVERSION                      */
#define _AGC_IPVERSION_IPVERSION_SHIFT                 0                                       /**< Shift value for AGC_IPVERSION               */
#define _AGC_IPVERSION_IPVERSION_MASK                  0xFFFFFFFFUL                            /**< Bit mask for AGC_IPVERSION                  */
#define _AGC_IPVERSION_IPVERSION_DEFAULT               0x00000003UL                            /**< Mode DEFAULT for AGC_IPVERSION              */
#define AGC_IPVERSION_IPVERSION_DEFAULT                (_AGC_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for AGC_IPVERSION      */

/* Bit fields for AGC EN */
#define _AGC_EN_RESETVALUE                             0x00000000UL                     /**< Default value for AGC_EN                    */
#define _AGC_EN_MASK                                   0x00000001UL                     /**< Mask for AGC_EN                             */
#define AGC_EN_EN                                      (0x1UL << 0)                     /**< Enable peripheral clock to this module      */
#define _AGC_EN_EN_SHIFT                               0                                /**< Shift value for AGC_EN                      */
#define _AGC_EN_EN_MASK                                0x1UL                            /**< Bit mask for AGC_EN                         */
#define _AGC_EN_EN_DEFAULT                             0x00000000UL                     /**< Mode DEFAULT for AGC_EN                     */
#define AGC_EN_EN_DEFAULT                              (_AGC_EN_EN_DEFAULT << 0)        /**< Shifted mode DEFAULT for AGC_EN             */

