SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_agc.h
/* Bit fields for AGC PNRFATT3 */
#define _AGC_PNRFATT3_RESETVALUE                       0x02107C18UL                                /**< Default value for AGC_PNRFATT3              */
#define _AGC_PNRFATT3_MASK                             0x3FFFFFFFUL                                /**< Mask for AGC_PNRFATT3                       */
#define _AGC_PNRFATT3_LNAMIXRFATT10_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT10           */
#define _AGC_PNRFATT3_LNAMIXRFATT10_MASK               0x3FFUL                                     /**< Bit mask for AGC_LNAMIXRFATT10              */
#define _AGC_PNRFATT3_LNAMIXRFATT10_DEFAULT            0x00000018UL                                /**< Mode DEFAULT for AGC_PNRFATT3               */
#define AGC_PNRFATT3_LNAMIXRFATT10_DEFAULT             (_AGC_PNRFATT3_LNAMIXRFATT10_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT3       */
#define _AGC_PNRFATT3_LNAMIXRFATT11_SHIFT              10                                          /**< Shift value for AGC_LNAMIXRFATT11           */
#define _AGC_PNRFATT3_LNAMIXRFATT11_MASK               0xFFC00UL                                   /**< Bit mask for AGC_LNAMIXRFATT11              */
#define _AGC_PNRFATT3_LNAMIXRFATT11_DEFAULT            0x0000001FUL                                /**< Mode DEFAULT for AGC_PNRFATT3               */
#define AGC_PNRFATT3_LNAMIXRFATT11_DEFAULT             (_AGC_PNRFATT3_LNAMIXRFATT11_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFATT3       */
#define _AGC_PNRFATT3_LNAMIXRFATT12_SHIFT              20                                          /**< Shift value for AGC_LNAMIXRFATT12           */
#define _AGC_PNRFATT3_LNAMIXRFATT12_MASK               0x3FF00000UL                                /**< Bit mask for AGC_LNAMIXRFATT12              */
#define _AGC_PNRFATT3_LNAMIXRFATT12_DEFAULT            0x00000021UL                                /**< Mode DEFAULT for AGC_PNRFATT3               */
#define AGC_PNRFATT3_LNAMIXRFATT12_DEFAULT             (_AGC_PNRFATT3_LNAMIXRFATT12_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFATT3       */

/* Bit fields for AGC PNRFATT4 */
#define _AGC_PNRFATT4_RESETVALUE                       0x06E0FC2FUL                                /**< Default value for AGC_PNRFATT4              */
#define _AGC_PNRFATT4_MASK                             0x3FFFFFFFUL                                /**< Mask for AGC_PNRFATT4                       */
#define _AGC_PNRFATT4_LNAMIXRFATT13_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT13           */
#define _AGC_PNRFATT4_LNAMIXRFATT13_MASK               0x3FFUL                                     /**< Bit mask for AGC_LNAMIXRFATT13              */
#define _AGC_PNRFATT4_LNAMIXRFATT13_DEFAULT            0x0000002FUL                                /**< Mode DEFAULT for AGC_PNRFATT4               */
#define AGC_PNRFATT4_LNAMIXRFATT13_DEFAULT             (_AGC_PNRFATT4_LNAMIXRFATT13_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT4       */
#define _AGC_PNRFATT4_LNAMIXRFATT14_SHIFT              10                                          /**< Shift value for AGC_LNAMIXRFATT14           */
#define _AGC_PNRFATT4_LNAMIXRFATT14_MASK               0xFFC00UL                                   /**< Bit mask for AGC_LNAMIXRFATT14              */
#define _AGC_PNRFATT4_LNAMIXRFATT14_DEFAULT            0x0000003FUL                                /**< Mode DEFAULT for AGC_PNRFATT4               */
#define AGC_PNRFATT4_LNAMIXRFATT14_DEFAULT             (_AGC_PNRFATT4_LNAMIXRFATT14_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFATT4       */
#define _AGC_PNRFATT4_LNAMIXRFATT15_SHIFT              20                                          /**< Shift value for AGC_LNAMIXRFATT15           */
#define _AGC_PNRFATT4_LNAMIXRFATT15_MASK               0x3FF00000UL                                /**< Bit mask for AGC_LNAMIXRFATT15              */
#define _AGC_PNRFATT4_LNAMIXRFATT15_DEFAULT            0x0000006EUL                                /**< Mode DEFAULT for AGC_PNRFATT4               */
#define AGC_PNRFATT4_LNAMIXRFATT15_DEFAULT             (_AGC_PNRFATT4_LNAMIXRFATT15_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFATT4       */

/* Bit fields for AGC PNRFATT5 */
#define _AGC_PNRFATT5_RESETVALUE                       0x0180480FUL                                /**< Default value for AGC_PNRFATT5              */
#define _AGC_PNRFATT5_MASK                             0x3FFFFFFFUL                                /**< Mask for AGC_PNRFATT5                       */
#define _AGC_PNRFATT5_LNAMIXRFATT16_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT16           */
#define _AGC_PNRFATT5_LNAMIXRFATT16_MASK               0x3FFUL                                     /**< Bit mask for AGC_LNAMIXRFATT16              */
#define _AGC_PNRFATT5_LNAMIXRFATT16_DEFAULT            0x0000000FUL                                /**< Mode DEFAULT for AGC_PNRFATT5               */
#define AGC_PNRFATT5_LNAMIXRFATT16_DEFAULT             (_AGC_PNRFATT5_LNAMIXRFATT16_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT5       */
#define _AGC_PNRFATT5_LNAMIXRFATT17_SHIFT              10                                          /**< Shift value for AGC_LNAMIXRFATT17           */
#define _AGC_PNRFATT5_LNAMIXRFATT17_MASK               0xFFC00UL                                   /**< Bit mask for AGC_LNAMIXRFATT17              */
#define _AGC_PNRFATT5_LNAMIXRFATT17_DEFAULT            0x00000012UL                                /**< Mode DEFAULT for AGC_PNRFATT5               */
#define AGC_PNRFATT5_LNAMIXRFATT17_DEFAULT             (_AGC_PNRFATT5_LNAMIXRFATT17_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFATT5       */
#define _AGC_PNRFATT5_LNAMIXRFATT18_SHIFT              20                                          /**< Shift value for AGC_LNAMIXRFATT18           */
#define _AGC_PNRFATT5_LNAMIXRFATT18_MASK               0x3FF00000UL                                /**< Bit mask for AGC_LNAMIXRFATT18              */
#define _AGC_PNRFATT5_LNAMIXRFATT18_DEFAULT            0x00000018UL                                /**< Mode DEFAULT for AGC_PNRFATT5               */
#define AGC_PNRFATT5_LNAMIXRFATT18_DEFAULT             (_AGC_PNRFATT5_LNAMIXRFATT18_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFATT5       */

/* Bit fields for AGC PNRFATT6 */
#define _AGC_PNRFATT6_RESETVALUE                       0x02F0841FUL                                /**< Default value for AGC_PNRFATT6              */
#define _AGC_PNRFATT6_MASK                             0x3FFFFFFFUL                                /**< Mask for AGC_PNRFATT6                       */
#define _AGC_PNRFATT6_LNAMIXRFATT19_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT19           */
#define _AGC_PNRFATT6_LNAMIXRFATT19_MASK               0x3FFUL                                     /**< Bit mask for AGC_LNAMIXRFATT19              */
#define _AGC_PNRFATT6_LNAMIXRFATT19_DEFAULT            0x0000001FUL                                /**< Mode DEFAULT for AGC_PNRFATT6               */
#define AGC_PNRFATT6_LNAMIXRFATT19_DEFAULT             (_AGC_PNRFATT6_LNAMIXRFATT19_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT6       */
#define _AGC_PNRFATT6_LNAMIXRFATT20_SHIFT              10                                          /**< Shift value for AGC_LNAMIXRFATT20           */
#define _AGC_PNRFATT6_LNAMIXRFATT20_MASK               0xFFC00UL                                   /**< Bit mask for AGC_LNAMIXRFATT20              */
#define _AGC_PNRFATT6_LNAMIXRFATT20_DEFAULT            0x00000021UL                                /**< Mode DEFAULT for AGC_PNRFATT6               */
#define AGC_PNRFATT6_LNAMIXRFATT20_DEFAULT             (_AGC_PNRFATT6_LNAMIXRFATT20_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFATT6       */
#define _AGC_PNRFATT6_LNAMIXRFATT21_SHIFT              20                                          /**< Shift value for AGC_LNAMIXRFATT21           */
#define _AGC_PNRFATT6_LNAMIXRFATT21_MASK               0x3FF00000UL                                /**< Bit mask for AGC_LNAMIXRFATT21              */
#define _AGC_PNRFATT6_LNAMIXRFATT21_DEFAULT            0x0000002FUL                                /**< Mode DEFAULT for AGC_PNRFATT6               */
#define AGC_PNRFATT6_LNAMIXRFATT21_DEFAULT             (_AGC_PNRFATT6_LNAMIXRFATT21_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFATT6       */

/* Bit fields for AGC PNRFATT7 */
#define _AGC_PNRFATT7_RESETVALUE                       0x07F1B83FUL                                /**< Default value for AGC_PNRFATT7              */
#define _AGC_PNRFATT7_MASK                             0x3FFFFFFFUL                                /**< Mask for AGC_PNRFATT7                       */
#define _AGC_PNRFATT7_LNAMIXRFATT22_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT22           */
#define _AGC_PNRFATT7_LNAMIXRFATT22_MASK               0x3FFUL                                     /**< Bit mask for AGC_LNAMIXRFATT22              */
#define _AGC_PNRFATT7_LNAMIXRFATT22_DEFAULT            0x0000003FUL                                /**< Mode DEFAULT for AGC_PNRFATT7               */
#define AGC_PNRFATT7_LNAMIXRFATT22_DEFAULT             (_AGC_PNRFATT7_LNAMIXRFATT22_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT7       */
#define _AGC_PNRFATT7_LNAMIXRFATT23_SHIFT              10                                          /**< Shift value for AGC_LNAMIXRFATT23           */
#define _AGC_PNRFATT7_LNAMIXRFATT23_MASK               0xFFC00UL                                   /**< Bit mask for AGC_LNAMIXRFATT23              */
#define _AGC_PNRFATT7_LNAMIXRFATT23_DEFAULT            0x0000006EUL                                /**< Mode DEFAULT for AGC_PNRFATT7               */
#define AGC_PNRFATT7_LNAMIXRFATT23_DEFAULT             (_AGC_PNRFATT7_LNAMIXRFATT23_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFATT7       */
#define _AGC_PNRFATT7_LNAMIXRFATT24_SHIFT              20                                          /**< Shift value for AGC_LNAMIXRFATT24           */
#define _AGC_PNRFATT7_LNAMIXRFATT24_MASK               0x3FF00000UL                                /**< Bit mask for AGC_LNAMIXRFATT24              */
#define _AGC_PNRFATT7_LNAMIXRFATT24_DEFAULT            0x0000007FUL                                /**< Mode DEFAULT for AGC_PNRFATT7               */
#define AGC_PNRFATT7_LNAMIXRFATT24_DEFAULT             (_AGC_PNRFATT7_LNAMIXRFATT24_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFATT7       */

