SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_agc.h
/* Bit fields for AGC PNRFFILT4 */
#define _AGC_PNRFFILT4_RESETVALUE                      0x06E0FC2FUL                                 /**< Default value for AGC_PNRFFILT4             */
#define _AGC_PNRFFILT4_MASK                            0x3FFFFFFFUL                                 /**< Mask for AGC_PNRFFILT4                      */
#define _AGC_PNRFFILT4_LNAMIXRFATT13_SHIFT             0                                            /**< Shift value for AGC_LNAMIXRFATT13           */
#define _AGC_PNRFFILT4_LNAMIXRFATT13_MASK              0x3FFUL                                      /**< Bit mask for AGC_LNAMIXRFATT13              */
#define _AGC_PNRFFILT4_LNAMIXRFATT13_DEFAULT           0x0000002FUL                                 /**< Mode DEFAULT for AGC_PNRFFILT4              */
#define AGC_PNRFFILT4_LNAMIXRFATT13_DEFAULT            (_AGC_PNRFFILT4_LNAMIXRFATT13_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFFILT4      */
#define _AGC_PNRFFILT4_LNAMIXRFATT14_SHIFT             10                                           /**< Shift value for AGC_LNAMIXRFATT14           */
#define _AGC_PNRFFILT4_LNAMIXRFATT14_MASK              0xFFC00UL                                    /**< Bit mask for AGC_LNAMIXRFATT14              */
#define _AGC_PNRFFILT4_LNAMIXRFATT14_DEFAULT           0x0000003FUL                                 /**< Mode DEFAULT for AGC_PNRFFILT4              */
#define AGC_PNRFFILT4_LNAMIXRFATT14_DEFAULT            (_AGC_PNRFFILT4_LNAMIXRFATT14_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFFILT4      */
#define _AGC_PNRFFILT4_LNAMIXRFATT15_SHIFT             20                                           /**< Shift value for AGC_LNAMIXRFATT15           */
#define _AGC_PNRFFILT4_LNAMIXRFATT15_MASK              0x3FF00000UL                                 /**< Bit mask for AGC_LNAMIXRFATT15              */
#define _AGC_PNRFFILT4_LNAMIXRFATT15_DEFAULT           0x0000006EUL                                 /**< Mode DEFAULT for AGC_PNRFFILT4              */
#define AGC_PNRFFILT4_LNAMIXRFATT15_DEFAULT            (_AGC_PNRFFILT4_LNAMIXRFATT15_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFFILT4      */

/* Bit fields for AGC PNRFFILT5 */
#define _AGC_PNRFFILT5_RESETVALUE                      0x0180480FUL                                 /**< Default value for AGC_PNRFFILT5             */
#define _AGC_PNRFFILT5_MASK                            0x3FFFFFFFUL                                 /**< Mask for AGC_PNRFFILT5                      */
#define _AGC_PNRFFILT5_LNAMIXRFATT16_SHIFT             0                                            /**< Shift value for AGC_LNAMIXRFATT16           */
#define _AGC_PNRFFILT5_LNAMIXRFATT16_MASK              0x3FFUL                                      /**< Bit mask for AGC_LNAMIXRFATT16              */
#define _AGC_PNRFFILT5_LNAMIXRFATT16_DEFAULT           0x0000000FUL                                 /**< Mode DEFAULT for AGC_PNRFFILT5              */
#define AGC_PNRFFILT5_LNAMIXRFATT16_DEFAULT            (_AGC_PNRFFILT5_LNAMIXRFATT16_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFFILT5      */
#define _AGC_PNRFFILT5_LNAMIXRFATT17_SHIFT             10                                           /**< Shift value for AGC_LNAMIXRFATT17           */
#define _AGC_PNRFFILT5_LNAMIXRFATT17_MASK              0xFFC00UL                                    /**< Bit mask for AGC_LNAMIXRFATT17              */
#define _AGC_PNRFFILT5_LNAMIXRFATT17_DEFAULT           0x00000012UL                                 /**< Mode DEFAULT for AGC_PNRFFILT5              */
#define AGC_PNRFFILT5_LNAMIXRFATT17_DEFAULT            (_AGC_PNRFFILT5_LNAMIXRFATT17_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFFILT5      */
#define _AGC_PNRFFILT5_LNAMIXRFATT18_SHIFT             20                                           /**< Shift value for AGC_LNAMIXRFATT18           */
#define _AGC_PNRFFILT5_LNAMIXRFATT18_MASK              0x3FF00000UL                                 /**< Bit mask for AGC_LNAMIXRFATT18              */
#define _AGC_PNRFFILT5_LNAMIXRFATT18_DEFAULT           0x00000018UL                                 /**< Mode DEFAULT for AGC_PNRFFILT5              */
#define AGC_PNRFFILT5_LNAMIXRFATT18_DEFAULT            (_AGC_PNRFFILT5_LNAMIXRFATT18_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFFILT5      */

/* Bit fields for AGC PNRFFILT6 */
#define _AGC_PNRFFILT6_RESETVALUE                      0x02F0841FUL                                 /**< Default value for AGC_PNRFFILT6             */
#define _AGC_PNRFFILT6_MASK                            0x3FFFFFFFUL                                 /**< Mask for AGC_PNRFFILT6                      */
#define _AGC_PNRFFILT6_LNAMIXRFATT19_SHIFT             0                                            /**< Shift value for AGC_LNAMIXRFATT19           */
#define _AGC_PNRFFILT6_LNAMIXRFATT19_MASK              0x3FFUL                                      /**< Bit mask for AGC_LNAMIXRFATT19              */
#define _AGC_PNRFFILT6_LNAMIXRFATT19_DEFAULT           0x0000001FUL                                 /**< Mode DEFAULT for AGC_PNRFFILT6              */
#define AGC_PNRFFILT6_LNAMIXRFATT19_DEFAULT            (_AGC_PNRFFILT6_LNAMIXRFATT19_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFFILT6      */
#define _AGC_PNRFFILT6_LNAMIXRFATT20_SHIFT             10                                           /**< Shift value for AGC_LNAMIXRFATT20           */
#define _AGC_PNRFFILT6_LNAMIXRFATT20_MASK              0xFFC00UL                                    /**< Bit mask for AGC_LNAMIXRFATT20              */
#define _AGC_PNRFFILT6_LNAMIXRFATT20_DEFAULT           0x00000021UL                                 /**< Mode DEFAULT for AGC_PNRFFILT6              */
#define AGC_PNRFFILT6_LNAMIXRFATT20_DEFAULT            (_AGC_PNRFFILT6_LNAMIXRFATT20_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFFILT6      */
#define _AGC_PNRFFILT6_LNAMIXRFATT21_SHIFT             20                                           /**< Shift value for AGC_LNAMIXRFATT21           */
#define _AGC_PNRFFILT6_LNAMIXRFATT21_MASK              0x3FF00000UL                                 /**< Bit mask for AGC_LNAMIXRFATT21              */
#define _AGC_PNRFFILT6_LNAMIXRFATT21_DEFAULT           0x0000002FUL                                 /**< Mode DEFAULT for AGC_PNRFFILT6              */
#define AGC_PNRFFILT6_LNAMIXRFATT21_DEFAULT            (_AGC_PNRFFILT6_LNAMIXRFATT21_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFFILT6      */

/* Bit fields for AGC PNRFFILT7 */
#define _AGC_PNRFFILT7_RESETVALUE                      0x07F1B83FUL                                 /**< Default value for AGC_PNRFFILT7             */
#define _AGC_PNRFFILT7_MASK                            0x3FFFFFFFUL                                 /**< Mask for AGC_PNRFFILT7                      */
#define _AGC_PNRFFILT7_LNAMIXRFATT22_SHIFT             0                                            /**< Shift value for AGC_LNAMIXRFATT22           */
#define _AGC_PNRFFILT7_LNAMIXRFATT22_MASK              0x3FFUL                                      /**< Bit mask for AGC_LNAMIXRFATT22              */
#define _AGC_PNRFFILT7_LNAMIXRFATT22_DEFAULT           0x0000003FUL                                 /**< Mode DEFAULT for AGC_PNRFFILT7              */
#define AGC_PNRFFILT7_LNAMIXRFATT22_DEFAULT            (_AGC_PNRFFILT7_LNAMIXRFATT22_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFFILT7      */
#define _AGC_PNRFFILT7_LNAMIXRFATT23_SHIFT             10                                           /**< Shift value for AGC_LNAMIXRFATT23           */
#define _AGC_PNRFFILT7_LNAMIXRFATT23_MASK              0xFFC00UL                                    /**< Bit mask for AGC_LNAMIXRFATT23              */
#define _AGC_PNRFFILT7_LNAMIXRFATT23_DEFAULT           0x0000006EUL                                 /**< Mode DEFAULT for AGC_PNRFFILT7              */
#define AGC_PNRFFILT7_LNAMIXRFATT23_DEFAULT            (_AGC_PNRFFILT7_LNAMIXRFATT23_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFFILT7      */
#define _AGC_PNRFFILT7_LNAMIXRFATT24_SHIFT             20                                           /**< Shift value for AGC_LNAMIXRFATT24           */
#define _AGC_PNRFFILT7_LNAMIXRFATT24_MASK              0x3FF00000UL                                 /**< Bit mask for AGC_LNAMIXRFATT24              */
#define _AGC_PNRFFILT7_LNAMIXRFATT24_DEFAULT           0x0000007FUL                                 /**< Mode DEFAULT for AGC_PNRFFILT7              */
#define AGC_PNRFFILT7_LNAMIXRFATT24_DEFAULT            (_AGC_PNRFFILT7_LNAMIXRFATT24_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFFILT7      */

/* Bit fields for AGC FENOTCHATT0 */
#define _AGC_FENOTCHATT0_RESETVALUE                    0x00000000UL                                     /**< Default value for AGC_FENOTCHATT0           */
#define _AGC_FENOTCHATT0_MASK                          0x3FFF3FFFUL                                     /**< Mask for AGC_FENOTCHATT0                    */
#define _AGC_FENOTCHATT0_FENOTCHATTNSEL1_SHIFT         0                                                /**< Shift value for AGC_FENOTCHATTNSEL1         */
#define _AGC_FENOTCHATT0_FENOTCHATTNSEL1_MASK          0xFUL                                            /**< Bit mask for AGC_FENOTCHATTNSEL1            */
#define _AGC_FENOTCHATT0_FENOTCHATTNSEL1_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT0            */
#define AGC_FENOTCHATT0_FENOTCHATTNSEL1_DEFAULT        (_AGC_FENOTCHATT0_FENOTCHATTNSEL1_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT0    */
#define _AGC_FENOTCHATT0_FENOTCHCAPCRSE1_SHIFT         4                                                /**< Shift value for AGC_FENOTCHCAPCRSE1         */
#define _AGC_FENOTCHATT0_FENOTCHCAPCRSE1_MASK          0xF0UL                                           /**< Bit mask for AGC_FENOTCHCAPCRSE1            */
#define _AGC_FENOTCHATT0_FENOTCHCAPCRSE1_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT0            */
#define AGC_FENOTCHATT0_FENOTCHCAPCRSE1_DEFAULT        (_AGC_FENOTCHATT0_FENOTCHCAPCRSE1_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT0    */
#define _AGC_FENOTCHATT0_FENOTCHCAPFINE1_SHIFT         8                                                /**< Shift value for AGC_FENOTCHCAPFINE1         */
#define _AGC_FENOTCHATT0_FENOTCHCAPFINE1_MASK          0xF00UL                                          /**< Bit mask for AGC_FENOTCHCAPFINE1            */
#define _AGC_FENOTCHATT0_FENOTCHCAPFINE1_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT0            */
#define AGC_FENOTCHATT0_FENOTCHCAPFINE1_DEFAULT        (_AGC_FENOTCHATT0_FENOTCHCAPFINE1_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT0    */
#define AGC_FENOTCHATT0_FENOTCHRATTNEN1                (0x1UL << 12)                                    /**< FE notch rattn enable for index 1           */
#define _AGC_FENOTCHATT0_FENOTCHRATTNEN1_SHIFT         12                                               /**< Shift value for AGC_FENOTCHRATTNEN1         */
#define _AGC_FENOTCHATT0_FENOTCHRATTNEN1_MASK          0x1000UL                                         /**< Bit mask for AGC_FENOTCHRATTNEN1            */
#define _AGC_FENOTCHATT0_FENOTCHRATTNEN1_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT0            */
#define AGC_FENOTCHATT0_FENOTCHRATTNEN1_DEFAULT        (_AGC_FENOTCHATT0_FENOTCHRATTNEN1_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHATT0    */
#define AGC_FENOTCHATT0_FENOTCHEN1                     (0x1UL << 13)                                    /**< FE notch enable for index 1                 */
#define _AGC_FENOTCHATT0_FENOTCHEN1_SHIFT              13                                               /**< Shift value for AGC_FENOTCHEN1              */
#define _AGC_FENOTCHATT0_FENOTCHEN1_MASK               0x2000UL                                         /**< Bit mask for AGC_FENOTCHEN1                 */
#define _AGC_FENOTCHATT0_FENOTCHEN1_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT0            */
#define AGC_FENOTCHATT0_FENOTCHEN1_DEFAULT             (_AGC_FENOTCHATT0_FENOTCHEN1_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT0    */
#define _AGC_FENOTCHATT0_FENOTCHATTNSEL2_SHIFT         16                                               /**< Shift value for AGC_FENOTCHATTNSEL2         */
#define _AGC_FENOTCHATT0_FENOTCHATTNSEL2_MASK          0xF0000UL                                        /**< Bit mask for AGC_FENOTCHATTNSEL2            */
#define _AGC_FENOTCHATT0_FENOTCHATTNSEL2_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT0            */
#define AGC_FENOTCHATT0_FENOTCHATTNSEL2_DEFAULT        (_AGC_FENOTCHATT0_FENOTCHATTNSEL2_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHATT0    */
#define _AGC_FENOTCHATT0_FENOTCHCAPCRSE2_SHIFT         20                                               /**< Shift value for AGC_FENOTCHCAPCRSE2         */
#define _AGC_FENOTCHATT0_FENOTCHCAPCRSE2_MASK          0xF00000UL                                       /**< Bit mask for AGC_FENOTCHCAPCRSE2            */
#define _AGC_FENOTCHATT0_FENOTCHCAPCRSE2_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT0            */
#define AGC_FENOTCHATT0_FENOTCHCAPCRSE2_DEFAULT        (_AGC_FENOTCHATT0_FENOTCHCAPCRSE2_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHATT0    */
#define _AGC_FENOTCHATT0_FENOTCHCAPFINE2_SHIFT         24                                               /**< Shift value for AGC_FENOTCHCAPFINE2         */
#define _AGC_FENOTCHATT0_FENOTCHCAPFINE2_MASK          0xF000000UL                                      /**< Bit mask for AGC_FENOTCHCAPFINE2            */
#define _AGC_FENOTCHATT0_FENOTCHCAPFINE2_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT0            */
#define AGC_FENOTCHATT0_FENOTCHCAPFINE2_DEFAULT        (_AGC_FENOTCHATT0_FENOTCHCAPFINE2_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHATT0    */
#define AGC_FENOTCHATT0_FENOTCHRATTNEN2                (0x1UL << 28)                                    /**< FE notch rattn enable for index 2           */
#define _AGC_FENOTCHATT0_FENOTCHRATTNEN2_SHIFT         28                                               /**< Shift value for AGC_FENOTCHRATTNEN2         */
#define _AGC_FENOTCHATT0_FENOTCHRATTNEN2_MASK          0x10000000UL                                     /**< Bit mask for AGC_FENOTCHRATTNEN2            */
#define _AGC_FENOTCHATT0_FENOTCHRATTNEN2_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT0            */
#define AGC_FENOTCHATT0_FENOTCHRATTNEN2_DEFAULT        (_AGC_FENOTCHATT0_FENOTCHRATTNEN2_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHATT0    */
#define AGC_FENOTCHATT0_FENOTCHEN2                     (0x1UL << 29)                                    /**< FE notch enable for index 2                 */
#define _AGC_FENOTCHATT0_FENOTCHEN2_SHIFT              29                                               /**< Shift value for AGC_FENOTCHEN2              */
#define _AGC_FENOTCHATT0_FENOTCHEN2_MASK               0x20000000UL                                     /**< Bit mask for AGC_FENOTCHEN2                 */
#define _AGC_FENOTCHATT0_FENOTCHEN2_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT0            */
#define AGC_FENOTCHATT0_FENOTCHEN2_DEFAULT             (_AGC_FENOTCHATT0_FENOTCHEN2_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT0    */

/* Bit fields for AGC FENOTCHATT1 */
#define _AGC_FENOTCHATT1_RESETVALUE                    0x00000000UL                                     /**< Default value for AGC_FENOTCHATT1           */
#define _AGC_FENOTCHATT1_MASK                          0x3FFF3FFFUL                                     /**< Mask for AGC_FENOTCHATT1                    */
#define _AGC_FENOTCHATT1_FENOTCHATTNSEL3_SHIFT         0                                                /**< Shift value for AGC_FENOTCHATTNSEL3         */
#define _AGC_FENOTCHATT1_FENOTCHATTNSEL3_MASK          0xFUL                                            /**< Bit mask for AGC_FENOTCHATTNSEL3            */
#define _AGC_FENOTCHATT1_FENOTCHATTNSEL3_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT1            */
#define AGC_FENOTCHATT1_FENOTCHATTNSEL3_DEFAULT        (_AGC_FENOTCHATT1_FENOTCHATTNSEL3_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT1    */
#define _AGC_FENOTCHATT1_FENOTCHCAPCRSE3_SHIFT         4                                                /**< Shift value for AGC_FENOTCHCAPCRSE3         */
#define _AGC_FENOTCHATT1_FENOTCHCAPCRSE3_MASK          0xF0UL                                           /**< Bit mask for AGC_FENOTCHCAPCRSE3            */
#define _AGC_FENOTCHATT1_FENOTCHCAPCRSE3_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT1            */
#define AGC_FENOTCHATT1_FENOTCHCAPCRSE3_DEFAULT        (_AGC_FENOTCHATT1_FENOTCHCAPCRSE3_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT1    */
#define _AGC_FENOTCHATT1_FENOTCHCAPFINE3_SHIFT         8                                                /**< Shift value for AGC_FENOTCHCAPFINE3         */
#define _AGC_FENOTCHATT1_FENOTCHCAPFINE3_MASK          0xF00UL                                          /**< Bit mask for AGC_FENOTCHCAPFINE3            */
#define _AGC_FENOTCHATT1_FENOTCHCAPFINE3_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT1            */
#define AGC_FENOTCHATT1_FENOTCHCAPFINE3_DEFAULT        (_AGC_FENOTCHATT1_FENOTCHCAPFINE3_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT1    */
#define AGC_FENOTCHATT1_FENOTCHRATTNEN3                (0x1UL << 12)                                    /**< FE notch rattn enable for index 3           */
#define _AGC_FENOTCHATT1_FENOTCHRATTNEN3_SHIFT         12                                               /**< Shift value for AGC_FENOTCHRATTNEN3         */
#define _AGC_FENOTCHATT1_FENOTCHRATTNEN3_MASK          0x1000UL                                         /**< Bit mask for AGC_FENOTCHRATTNEN3            */
#define _AGC_FENOTCHATT1_FENOTCHRATTNEN3_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT1            */
#define AGC_FENOTCHATT1_FENOTCHRATTNEN3_DEFAULT        (_AGC_FENOTCHATT1_FENOTCHRATTNEN3_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHATT1    */
#define AGC_FENOTCHATT1_FENOTCHEN3                     (0x1UL << 13)                                    /**< FE notch enable for index 3                 */
#define _AGC_FENOTCHATT1_FENOTCHEN3_SHIFT              13                                               /**< Shift value for AGC_FENOTCHEN3              */
#define _AGC_FENOTCHATT1_FENOTCHEN3_MASK               0x2000UL                                         /**< Bit mask for AGC_FENOTCHEN3                 */
#define _AGC_FENOTCHATT1_FENOTCHEN3_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT1            */
#define AGC_FENOTCHATT1_FENOTCHEN3_DEFAULT             (_AGC_FENOTCHATT1_FENOTCHEN3_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT1    */
#define _AGC_FENOTCHATT1_FENOTCHATTNSEL4_SHIFT         16                                               /**< Shift value for AGC_FENOTCHATTNSEL4         */
#define _AGC_FENOTCHATT1_FENOTCHATTNSEL4_MASK          0xF0000UL                                        /**< Bit mask for AGC_FENOTCHATTNSEL4            */
#define _AGC_FENOTCHATT1_FENOTCHATTNSEL4_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT1            */
#define AGC_FENOTCHATT1_FENOTCHATTNSEL4_DEFAULT        (_AGC_FENOTCHATT1_FENOTCHATTNSEL4_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHATT1    */
#define _AGC_FENOTCHATT1_FENOTCHCAPCRSE4_SHIFT         20                                               /**< Shift value for AGC_FENOTCHCAPCRSE4         */
#define _AGC_FENOTCHATT1_FENOTCHCAPCRSE4_MASK          0xF00000UL                                       /**< Bit mask for AGC_FENOTCHCAPCRSE4            */
#define _AGC_FENOTCHATT1_FENOTCHCAPCRSE4_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT1            */
#define AGC_FENOTCHATT1_FENOTCHCAPCRSE4_DEFAULT        (_AGC_FENOTCHATT1_FENOTCHCAPCRSE4_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHATT1    */
#define _AGC_FENOTCHATT1_FENOTCHCAPFINE4_SHIFT         24                                               /**< Shift value for AGC_FENOTCHCAPFINE4         */
#define _AGC_FENOTCHATT1_FENOTCHCAPFINE4_MASK          0xF000000UL                                      /**< Bit mask for AGC_FENOTCHCAPFINE4            */
#define _AGC_FENOTCHATT1_FENOTCHCAPFINE4_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT1            */
#define AGC_FENOTCHATT1_FENOTCHCAPFINE4_DEFAULT        (_AGC_FENOTCHATT1_FENOTCHCAPFINE4_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHATT1    */
#define AGC_FENOTCHATT1_FENOTCHRATTNEN4                (0x1UL << 28)                                    /**< FE notch rattn enable for index 4           */
#define _AGC_FENOTCHATT1_FENOTCHRATTNEN4_SHIFT         28                                               /**< Shift value for AGC_FENOTCHRATTNEN4         */
#define _AGC_FENOTCHATT1_FENOTCHRATTNEN4_MASK          0x10000000UL                                     /**< Bit mask for AGC_FENOTCHRATTNEN4            */
#define _AGC_FENOTCHATT1_FENOTCHRATTNEN4_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT1            */
#define AGC_FENOTCHATT1_FENOTCHRATTNEN4_DEFAULT        (_AGC_FENOTCHATT1_FENOTCHRATTNEN4_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHATT1    */
#define AGC_FENOTCHATT1_FENOTCHEN4                     (0x1UL << 29)                                    /**< FE notch enable for index 4                 */
#define _AGC_FENOTCHATT1_FENOTCHEN4_SHIFT              29                                               /**< Shift value for AGC_FENOTCHEN4              */
#define _AGC_FENOTCHATT1_FENOTCHEN4_MASK               0x20000000UL                                     /**< Bit mask for AGC_FENOTCHEN4                 */
#define _AGC_FENOTCHATT1_FENOTCHEN4_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for AGC_FENOTCHATT1            */
#define AGC_FENOTCHATT1_FENOTCHEN4_DEFAULT             (_AGC_FENOTCHATT1_FENOTCHEN4_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT1    */

